#include <stdio.h>  /*включаем, инклюдим пастим сюда содержимое стандартной
для си библиотеки ввода вывода данных с и в командную строку */

/* char, int, float, double это 4 типа встроенных в си. Их можно расширить до long int, short int, unsigned int, unsighned lont int
float занимает 4 байта и имеет 6 цифр 0,123456, double занимает 8 байт и хранит до 10 цифр - 0,123456789
*/



int main() {             /* короче тут мы вводим аргументы для main() функции. В нашем случаее пусть они будут пустыми*/
  int number = 100;          /* простое целое число, помещается в простой int, могущий хранить число от -32768 до 32767 потому, как не unsighned, insigned хранит от 0 до ~65000*/
  double pi = 3.1415926536;  /*а вот и дабл пресижн флоат*/

  printf("integer is %d \n", number);
  printf("Values are %d and %f \n", number, pi);  /* int`ы через %d, флоты через %f */
  printf("%%7d displays %7d \n", number);     /* Выводим, отображаем int через %d так, что бы оно
                                                 отображалось с как 7ми разрядное число, пустые разряды
                                                 забиваются пробелами, удобно для идентацииб отступов*/
  printf("%%07d displays %07d \n", number);   /* Выводим int через %d(целое, инт) так, что бы где-то,
                                                 хрен его знает где было 7 разрядов(цифр) так, что бы
                                                 пустые разряды забивались, заполнялись нолями 0*/

  printf("Pi is approximately %1.4f\n", pi);     /*  Спецификатор точности округляет, а не обрезает*/
  printf("Right aligned %020.3f rounded pi\n", pi);     /*  Спецификатор точности округляет, а не обрезает*/
  printf("Left aligned %-20.3f rounded pi \n", pi);     /*  Спецификатор точности округляет, а не обрезает*/
  return 0;
}
